Revit 2026 API

# InSessionPrintSetting Properties

---

The InSessionPrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrintParameters | Returns the Parameters of Print Setup. |

#### Reference

InSessionPrintSetting Class

Autodesk.Revit.DB Namespace